Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/blood_and_organ_donation/blood_donation.html.txt.tmx
Source language: en
Languages: ga

source: The Irish Blood Transfusion Service (IBTS) is the State body with responsibility for the collection, processing, testing and distribution of blood and blood products
ga: Is í Seirbhís Fuilaistriúcháin na hÉireann an Comhlacht Stáit atá freagrach as bailiú, próiseáil, tástáil agus dáileadh fola agus táirgí fola in Éirinn

source: • Over 3,000 donations are needed every week
ga: • Teastaíonn os cionn 3,000 deonú gach seachtain

source: • 1 in 4 of us will need a transfusion at some point in our lives Donating blood
ga: • Teastóidh fuilaistriúchán ó dhuine as gach ceathrar againn am éigin

source: To become a blood donor you must be in good health, between 18 and 65 years of age and weigh at least 50kgs (7st 12lbs)
ga: Chun a bheith i do dheontóir fola, ní mór duit a bheith folláin, a bheith idir 18 agus 65 bliain d’aois agus a bheith ar a laghad 50 cileagram (7 gcloch 12 phunt)

source: You can donate every 90 days
ga: Is féidir leat fuil a dheonú gach 90 lá

source: When you volunteer to give blood you will be asked to register your details with the IBTS and to fill in a health and lifestyle questionaire
ga: • Nuair a roghnaíonn tú fuil a thabhairt, iarrfar ort do shonraí a chlárú le Seirbhís Fuilaistriúcháin na hÉireann agus ceistneoir sláinte agus stíl mhaireachtála a líonadh isteach

source: All the information you give will be treated in the strictest confidence
ga: Coinneofar an fhaisnéis go léir a thabharfaidh tú faoi rún

source: A drop of your blood will be analysed for haemoglobin (iron level) content. After the medical screening process, you will be shown to a donation bed
ga: • Tar éis an phróisis scagthástála leighis, tabharfar go dtí leaba deonaithe fola tú

source: A pressure cuff will be put around your upper arm and the area will be cleaned with an antiseptic
ga: Cuirfear cufa brú fola timpeall uachtar do láimh agus glanfar an áit le hantaiseipteach

source: A doctor or nurse will then insert a needle that is attached to a blood bag
ga: • Cuirfidh dochtúir nó altra snáthaid atá ceangailte le mála fola isteach i do lámh ansin

source: The bag is kept out of sight below the level of the bed
ga: Coinneofar an mála as amharc faoin leaba

source: You will be asked to open and close your hand to ensure smooth blood flow
ga: Iarrfar ort do lámh a oscailt agus a dhúnadh chun an sreabhadh fola a éascú

source: The donation itself takes between 8-15 minutes
ga: • Tógann an deonú fola féin idir 8-15 nóiméad

source: It holds 470 mls of blood (just under a pint).There is no risk of contracting any disease by donating blood
ga: Tógtar 470 ml fola (díreach faoi phionta)

source: A new sterile blood pack is used for every donor
ga: Níl aon bhaol ann go bhfaighfeá aon ghalar trí dheonú fola

source: It is never reused
ga: Ní bhaintear athúsáid as riamh

source: You will rest after the donation and will be served refreshments
ga: • Glacfaidh tú scíth tar éis do chuid fola a thabhairt agus tabharfar sólaistí duit

source: You should allow yourself about an hour in total and should avoid heavy lifting, pushing or picking up heavy objects for at least four or five hours
ga: Ba chóir duit scíth uair an chloig a thabhairt duit féin, agus níor chóir duit aon ní trom a chrochadh, a bhrú nó a phiocadh suas ar feadh ceithre nó cúig uair an chloig ar a laghad

source: To ensure the safety of blood supplies, the IBTS tests every donation received for a number of diseases including Hepatitis B, HIV and Hepatitis C
ga: Ciallaíonn sé seo go ndéanann siad tástáil ar gach deonú fola a fhaightear i gcomhair roinnt galar, ina measc Heipitíteas B, VEID agus Heipitíteas C

source: Platelets are small blood cells that are present in the blood of all healthy people and are essential to enable blood to clot properly
ga: Is éard atá i bpláitíní ná cealla fola beaga atá i gcolainn gach duine folláin agus atá riachtanach ionas gur féidir le fuil téachtadh i gceart

source: Patients who do not have enough platelets in their blood are prone to spontaneous bleeding and are also likely to bleed too much during surgery
ga: Tá daoine nach bhfuil dóthain pláitíní ina gcuid fola i mbaol fuil a chur gan choinne agus d’fhéadfaidís freisin an iomarca fola a chailleadh le linn obráide

source: Platelets have a shelf-life of just 5–7 days after donation, so it is important to maintain a constant supply
ga: Ní mhaireann pláitíní ach 5-7 lá tar éis fuil a dheonú, mar sin tá sé tábhachtach soláthar leanúnach a chothú

source: Over 22,000 platelet transfusions are needed every year in Ireland, and this number is continuing to rise
ga: Teastaíonn os cionn 20,000 fuilaistriú pláitíní in Éirinn gach bliain, agus tá an líon seo fós ag dul i méid

source: Most of these platelets go to patients with serious medical conditions such as cancer or leukaemia, especially those receiving chemotherapy or after a bone marrow transplant
ga: Tugtar formhór na bpláitíní seo d’othair a bhfuil riochtaí leighis tromchúiseacha acu cosúil le hailse nó leoicéime, go háirithe iad siúd atá ag fáil ceimiteiripe nó tar éis trasphlandú smeara

source: Platelets may also be needed by:
ga: D’fhéadfadh sé go mbeadh gá acu seo a leanas le pláitíní freisin:

source: • Patients undergoing major surgery
ga: • Othair atá ag dul faoi obráid tromchúiseach

source: • Accident victims who have had extensive injury
ga: • Daoine a bhí i dtimpiste a bhfuil gortú mór ag baint dóibh

source: • New born babies who are born with low platelet counts
ga: • Naíonáin nuabheirthe a rugadh le comhaireamh íseal pláitíní

source: The Irish Unrelated Bone Marrow Registry (IUBMR) is a register of people who are willing to donate their bone marrow if they are found to match a patient needing a bone marrow transplant
ga: Is éard atá i gClárlann Smeara Neamhghaolta na hÉireann (Irish Unrelated Bone Marrow Registry - IUBMR) ná clárlann de dhaoine atá sásta a smior a dheonú má fhaightear amach go meaitseálann sé othar óna dteastaíonn trasphlandú smeara

source: The IUBMR is part of a worldwide network of unrelated donor registries
ga: Tá an Chlárlann ar chuid de líonra domhanda clárlanna deontóra neamhghaolta

source: The decision to become an unrelated bone marrow donor requires careful consideration
ga: Ní mór breithniú cúramach a dhéanamh ar an gcinneadh a bheith i do dheontóir smeara neamhghaolta

source: Read more about the Irish Unrelated Bone Marrow Registry
ga: Léigh tuilleadh faoi Clárlann Smeara Neamhghaolta na hÉireann

source: Who is eligible to donate blood?
ga: Cé atá incháilithe chun fuil a dheonú?

source: Before coming to a clinic to give blood, please check if you are eligible to donate
ga: Sula dtagann tú chuig clinic chun fuil a thabhairt, seiceáil an bhfuil tú incháilithe chun fuil a dheonú

source: Never give blood if:
ga: Ná tabhair fuil go brách má bhaineann na rudaí seo a leanas leat:

source: • You have received a blood transfusion (other than an autologous transfusion of your own blood) in Ireland on or after the 1st January 1980
ga: • Fuair tú fuilaistriúchán (seachas fuilaistriúchán uathlógach) in Éirinn an 1 Eanáir 1980 nó ina dhiaidh

source: • You received a blood transfusion (other than an autologous transfusion of your own blood) outside Ireland at anytime
ga: • Fuair tú fuilaistriúchán (seachas fuilaistriúchán uathlógach) taobh amuigh d’Éirinn ag am ar bith

source: • You have spent 1 year or more, in total, in the UK in the years 1980 to 1996
ga: • Chaith tú bliain amháin nó níos mó, san iomlán, sa Ríocht Aontaithe idir na blianta 1980 go dtí 1996

source: • You have ever used a needle to take unprescribed drugs, this includes body building drugs
ga: • Bhain tú úsáid ag tráth éigin as snáthaid chun drugaí nach cógais iad a thógáil

source: • You or your partner are HIV positive
ga: • Tá tusa nó do pháirtí VEID-deimhneach

source: • You have had Hepatitis B or C
ga: • Bhí Heipitíteas B nó C ort

source: You should not donate blood for 12 months if:
ga: Níor chóir duit fuil a dheonú ar feadh 12 mhí má bhaineann na rudaí seo a leanas leat:

source: • You have visited a malarial area
ga: • Thug tú cuairt ar cheantar ina bhfuil Maláire

source: • You have been pregnant
ga: • Bhí tú ag iompar clainne nó rugadh leanbh duit

source: You should not donate blood for 6 months if:
ga: Níor chóir duit fuil a dheonú ar feadh 6 mhí má bhaineann na rudaí seo a leanas leat:

source: • You have had a major surgery
ga: • Bhí mór obráid ort

source: You should not donate blood for 4 months if:
ga: Níor chóir duit fuil a dheonú ar feadh 4 mhí má bhaineann na rudaí seo a leanas leat:

source: • You have had a tattoo/ body piercing
ga: • Fuair tú tatú/ tolladh coirp

source: You should not donate blood for 3 months if:
ga: Níor chóir duit fuil a dheonú ar feadh 3 mhí má bhaineann na rudaí seo a leanas leat:

source: • You have visited a tropical area
ga: • Thug tú cuairt ar cheantar trópaiceach

source: You should not donate blood for 1 month if you have had contact with infectious diseases (where you have not been previously infected), for example, chicken pox, mumps, measles or German measles
ga: Níor chóir duit fuil a dheonú ar feadh míosa má bhí tú in aice le duine a bhfuil galar tógálach air/uirthi (sa chás nach raibh ionfhabhtú ort roimhe seo), m.sh

source: If you have travelled to an area at risk of West Nile Virus, you should wait 28 days after returning before you donate blood
ga: deilgneach, plucamas, bruitíneach nó bruitíneach dhearg (rubella)

source: You must be fully recovered for 2 weeks if you have had the flu or been on antibiotics
ga: Ní mór go bhfuil athshlánú iomlán tagtha ort ar feadh 2 sheachtain má bhí an fliú ort nó má bhí antaibheathaigh á nglacadh agat

source: You should not donate blood until fully recovered if you have a cold sore or a cold
ga: Ní chóir duit fuil a dheonú ar feadh coicíse má bhí an fliú ort le déanaí nó má bhí tú ar chúrsa antaibheathach

source: If you are on long-term medication, you should contact the IBTS before donating
ga: Níor chóir duit fuil a dheonú go dtí go bhfuil biseach iomlán ort má tá spuaic shlaghdáin nó slaghdán ort

source: If you are aged 65–69 you can only donate blood if you have given blood in the last 10 years
ga: Má tá tú idir 65 agus 69, ní féidir leat fuil a dheonú ach má thug tú fuil le 10 mbliana anuas

source: If you are aged over 70 you can donate blood if you have given blood in the last 2 years and you have a certificate of fitness from your GP
ga: Má tá tú os cionn 70, féadfaidh tú fuil a dheonú má thug tú fuil le 2 bhliain anuas agus má tá deimhniú oiriúnachta agat ó do DG

source: Who is eligible to donate platelets?
ga: Cé atá incháilithe chun pláitíní a dheonú?

source: You may be suitable to become a platelet donor if you:
ga: D’fhéadfadh sé go mbeifeá feiliúnach chun pláitíní a dheonú má tá an méid seo a leanas fíor fút:

source: • Are blood group O, A, B or AB
ga: • Tá fuilghrúpa O, A, B, nó AB agat

source: • Are between 18 and 59 years of age
ga: • Tá tú idir 18 agus 59 bliain d’aois

source: • Weigh over 9 stone 7 pounds (60kg)
ga: • Tá tú os cionn 9 gcloiche agus 7 bpunt (60kg) meáchain

source: You cannot become a platelet donor if:
ga: Ní féidir deontóir pláitíní a dhéanamh díot:

source: • You have ever received a blood transfusion
ga: • Má rinneadh fuilaistriú ort riamh

source: • You have ever been pregnant
ga: • Má bhí tú torrach riamh

source: • You need to take aspirin or anti-inflammatories regularly
ga: • Más gá duit aspairín nó drugaí frith-athlastacha a ghlacadh go rialta

source: You do not need to give blood first to become a platelet donor
ga: Ní gá duit fuil a thabhairt ar dtús chun bheith i do dheontóir pláitíní

source: However, if you have not given blood in Ireland in the last 5 years you must first give a sample for testing
ga: Murar thug tú fuil in Éirinn le 5 bliana anuas, áfach, ní mór duit samplaí a thabhairt le haghaidh tástála sula ndeonaíonn tú pláitíní

source: To find out if you can give blood you can take an eligibility quiz
ga: Faigh amach an féidir leat fuil a thabhairt trí quiz cáilitheachta a thógáil

source: There are 10 questions and it takes about a minute to complete
ga: Tá 10 gceist ann agus tógann sé timpeall nóiméad amháin chun é a chomhlánú

source: If you have any queries about donating blood, you can contact the Irish Blood Transfusion Service Information Line on 1850 731 137
ga: Má tá aon cheisteanna agat faoi fhuil a dheonú, seol teachtaireacht ríomhphoist info@ibts.ie nó cuir glaoch ar Líne Faisnéise Sheirbhís Fuilaistriúcháin na hÉireann ag 1850 731 137

source: You can get more information on www.giveblood.ie
ga: Is féidir leat tuilleadh eolais a fháil ag www.giveblood.ie

source: If you would like to schedule an appointment for an assessment to become a platelet donor please fill in the Online Platelet Application Form or contact 01 432 2833 (Dublin) or 021 480 7429 (Cork)
ga: Más mian leat coinne a chur in áirithe i gcomhair measúnú chun a bheith i do dheontóir pláitíní líon isteach an Fhoirm Iarratais Pláitíní nó téigh i dteagmháil le 01 432 2833 (Baile Átha Cliath) nó 021 480 7429 (Corcaigh)

source: Register for the Bone Marrow Panel by using the online application form
ga: Cláraigh don Phainéal Smeara trí úsáid a bhaint as an bhfoirm iarratais ar líne

source: View the dates and times of clinics in your area
ga: Faigh an clinic is gaire duit
